Confirmed that v0.2.3 addresses this issue. Thanks for the quick fix, appreciated.

```
% terraform -v
Terraform v1.6.6
on darwin_amd64
+ provider registry.terraform.io/tidbcloud/tidbcloud v0.2.3
% terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following
symbols:
  + create

Terraform will perform the following actions:

  # tidbcloud_cluster.serverless_tier_cluster will be created
  + resource "tidbcloud_cluster" "serverless_tier_cluster" {
      + cloud_provider   = "AWS"
      + cluster_type     = "DEVELOPER"
      + config           = {
          + components    = (known after apply)
          + port          = (known after apply)
          + root_password = "root_password"
        }
      + create_timestamp = (known after apply)
      + id               = (known after apply)
      + name             = "cluster-1"
      + project_id       = "1372813089189321298"
      + region           = "ap-northeast-1"
      + status           = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

tidbcloud_cluster.serverless_tier_cluster: Creating...
tidbcloud_cluster.serverless_tier_cluster: Creation complete after 3s [id=10305448456972893297]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

- `terraform plan` reports `No changes. Your infrastructure matches the configuration.` as expected.

```
% terraform plan
tidbcloud_cluster.serverless_tier_cluster: Refreshing state... [id=10305448456972893297]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are needed.
```

- `terraform apply` reports `No changes. Your infrastructure matches the configuration.` as expected.

```
% terraform apply
tidbcloud_cluster.serverless_tier_cluster: Refreshing state... [id=10305448456972893297]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are needed.

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.
```
